Revit 2024 API
TemporaryViewModes.DeactivateMode Method
 Deactivates the given temporary mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public void DeactivateMode(
	TemporaryViewMode mode
)
Visual Basic
Public Sub DeactivateMode ( _
	mode As TemporaryViewMode _
)
Visual C++
public:
void DeactivateMode(
	TemporaryViewMode mode
)
Parameters
mode
Type: Autodesk.Revit.DB.TemporaryViewMode
 The mode to deactivate
Remarks
 The method has no effect on modes that are already deactivated.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The temporary mode is not available in the associated view. The view is either of a type that does not support this mode, or is currently in a context that makes the mode presently inapplicable. -or- The temporary mode is presently not enabled in the associated view.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace